jmeter-test.yml
execution:
- concurrency: 5
  executor: jmeter
  hold-for: 1m
  ramp-up: 10s
  scenario: Thread Group
scenarios:
  Thread Group:
    requests:
    - label: uptimecheck
      method: GET
      url: https://stage-dot-voltaic-pilot-246410.appspot.com/
reporting:
    - module: final-stats
      summary: true  # overall samples count and percent of failures
      percentiles: true  # display average times and percentiles
      failed-labels: false  # provides list of sample labels with failures
      test-duration: true  # provides test duration
      dump-csv: reports/jmeter.csv